In [2]:
import numpy as np
import pandas as pd

# Concat

In [ ]:
# study sorurce => https://pandas.pydata.org/docs/user_guide/merging.html

In [ ]:
#simple stacking , not intelligent
#default is 0th axis

In [3]:
# Two companies data files.
a = pd.read_csv('a.csv')
b = pd.read_csv('b.csv')

In [4]:
a

    A   B
0  10  20
1  30  40

In [5]:
b

    A   C
0  10  20
1  30  40

In [6]:
pd.concat([a,b]) # simple adding not removing dupliate,not intelligence.

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [7]:
pd.concat([a,b],axis=0)#default axis is 0 ,it will stack one below the other

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [8]:
pd.concat([a,b],axis=1) #changing the default axis from 0 to 1 , it will stack side by side

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [9]:
# accessing the data after concat
data = pd.concat([a,b],axis=1)

In [10]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [11]:
type(data)

pandas.core.frame.DataFrame

In [15]:
# using loc and iloc accessing the data

data.loc[:]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [17]:
data.iloc[0:1]

    A   B   A   C
0  10  20  10  20

In [18]:
data.iloc[0:2,0:3]

    A   B   A
0  10  20  10
1  30  40  30

In [19]:
data.iloc[0:2,0:2]

    A   B
0  10  20
1  30  40

In [20]:
data.iloc[0:2,0:]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

# join ='inner' & join ='outer'

In [21]:
data = pd.concat([a,b],axis=0,join='inner') #join='inner'=> InterSecton will be considerd(common)

In [22]:
data

    A
0  10
1  30
0  10
1  30

In [27]:
a

    A   B
0  10  20
1  30  40

In [28]:
b

    A   C
0  10  20
1  30  40

In [25]:
data = pd.concat([a,b],axis=0,join='outer') #join='outer'=> Union will be considerd.(All data)

In [26]:
data

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0